$(function() {
  var hasIndex, index;
  hasIndex = window.location.href.split("?").length > 1;
  index = hasIndex ? window.location.href.split("?")[1].split("=")[1] : 0;


  var data = [
    //第一本书
    {
      //书的信息
      BookInformation: {
        bookName: "时代广场的蟋蟀",
        author: "(美)威廉姆斯 绘;(美)乔治.塞尔登",
        press: "中文天地出版股份有限公司",
        year: "2013-08",
        price: "15.00",
        Binding: "精装",
        folio: "16",
        ISBN: "9787539189437",
        imgUrl: "./img/1000001.jpg",
        authorIntro: "乔治赛尔登（1929-1989）出生于美国康涅狄格州，从康州的耶鲁大学毕业后，去罗马留学过一年，此后一直居住在纽约。热爱音乐。",
        //图书标签
        bookLabel: ['儿童文学', '友情', '成长', '外国文学', '经典'],
        //主题词
        themaWords: ['时代广场', '外国文学'],
        //内容提要
        contentSummary: '柴斯特，一只出生在康涅狄克州草原的蟋蟀，因为贪吃，被意外带到了纽约时代广场的地铁站。乡下来的小蟋蟀第一次出远门，就来到了全世界最繁华的地方。在这个全然陌生的世界，他幸运地被一个好心的男孩，报摊老板的儿子玛利欧收养，并与两个地铁站里的老住户亨利猫和塔克鼠成为了好朋友。柴斯特有着惊人的音乐天赋，他“演奏”的美妙音乐，打动了听过的每个人，成为了纽约最受瞩目的明星，改变了玛利欧一家人贫穷的生活。令人意外的是，柴斯特收获了那么多的掌声和鲜花，依旧念念不忘家乡的自由生活，于是他告别了朋友们，踏上了回家之路。',
        //本书目录
        catalogues: ['第一章　塔克', '第二章　玛利欧', '第三章　柴斯特', '第四章　亨利', '第五章　星期天早晨', '第六章　冯赛', '第七章　蟋蟀笼子', '第八章　塔克一生的积蓄', '第九章　中国晚餐', '第十章　晚宴', '第十一章　不祥之物', '第十二章　史麦德利先生', '第十三章　大出风头', '第十四章　奥尔甫斯', '第十五章　中央车站'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "上海书城福州店",
        address: "上海市黄浦区福州路465号世纪出版大厦"
      },
      {
        libraryName: "崇文书城",
        address: "武汉市洪山区雄楚大道268号"
      },
      {
        libraryName: "新华书店长沙市分公司",
        address: "长沙市五一东路285号"
      },
      {
        libraryName: "新华书店武侯祠店",
        address: "成都市武侯区武侯祠大街266号华达商城1层"
      },
      {
        libraryName: "新华书店内蒙古店",
        address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
      },
      {
        libraryName: "云南新华大厦",
        address: "昆明市人民东路6号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "湖南图书馆",
        address: "湖南省长沙市芙蓉区韶山北路157号"
      },
      {
        libraryName: "江西省图书馆",
        address: "江西省南昌市洪都北大道160号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-10 08:08:45",
        good: 3,
        bad: 3,
        con: "蟋蟀柴斯特用它绝妙的音乐天赋回报了朋友们的真诚友情，帮助玛利欧一家摆脱了困境，自己还成为了震惊整个纽约的演奏家！然而功成名就后的柴斯特却满心失落，思念起乡下自由自在的安静生活来"
      },
      {
        userName: "叫我胡三岁",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "首先非常羡慕蟋蟀，猫和老鼠不平常的友谊；其次我明白了饲养动物不光是为了使自己能得到快乐，更重要的是要从动物的快乐和自由着想；最后我懂得了我们每个人，每个同学都应该爱惜友谊，都有一个宽容的心，学会互相关爱，互相帮助。那么人间将会充满爱，充满欢声笑语的乐园。"
      },
      {
        userName: "亮的娟",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "经典的著作总会让人回味无穷，时代广场的蟋蟀就是其中一本，愿孩子阅读更多的美好和经典。"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "孩子很喜欢这个故事，非常值得一看。一只小蟋蟀无意中离开了家乡，来到了时代广场的小报亭生活下来，发生了很多趣事，也发生了意外，故事情节趣味十足，八岁的孩子跟着故事情节心情起伏不定，每晚读一些，有时候读着不想睡。故事很不错值得购买。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: " 乡下蟋蟀勇闯大纽约的奇妙征程，让音乐成为生命的底色，让友谊成为生命的温度，让心灵成为生命的归属,有趣的书籍,小朋友喜欢看"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: " 这本书也是朋友推荐才买的，里面都是满满的文字，对于一年级小孩来说，要想阅读还是有难度的。不过我打算作为故事书读给他听。"
      }
      ]


    },


    //第二本书   
    {
      //书的信息
      BookInformation: {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        price: "38.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg",
        authorIntro: "百万级畅销书《乖，摸摸头》作者。山东人，有故事的人，作家、主持人、民谣歌手、老背包客、不敬业的酒吧掌柜、科班油画画师、手鼓艺人、业余皮匠、业余银匠、业余诗人、资深西藏拉漂、资深丽江混混、黄金左脸、禅宗临济弟子……",
        //图书标签
        bookLabel: ['旅游', '丽江', '成长',],
        //主题词
        themaWords: ['旅游', '文学'],
        //内容提要
        contentSummary: '善良是一种天性，善意是一种选择。阿弥陀佛么么哒，是一句祝福，一份善意。百万级销量作家大冰2015年新书《阿弥陀佛么么哒》。12个不舍得读完的、暖心的、真实的江湖故事——或许会让你看到那些你永远无法去体会的生活，见识那些可能你永远都无法结交的人。《阿弥陀佛么么哒》中的这12个真实的江湖故事，有弥足珍贵的亲情，有一诺千金的古风，有传奇到死的女人，有肝胆相照的男人，有为理想而千辛万苦，锲而不舍的草根；有心心相印、真心不渝的生死爱情……他们很平常，很渺小，甚至奔走在社会底层，但他们很强大、很执着、很坚韧，有爱亦有恨，敢爱亦敢恨。他们不曾被生活模糊了面目、扫荡了梦想，无论现在、过去或者未来，他们都是尘世的特立独行者，努力寻找着处世和入世间的平衡。他们在《阿弥陀佛么么哒》里，陪伴你，并温暖你，为你点亮前行路上的明灯。《阿弥陀佛么么哒》这是一本超值的书。除了读到各种惊喜、各种惊叹、各种戳心、各种含笑流泪的故事之外，它还可以听。《阿弥陀佛么么哒》一书中的每篇文章后，都缀有音乐二维码，共计几十首有钱也买不到的原创民谣，免费赠予每一个读者。',
        //本书目录
        catalogues: ['一个孩子的心愿', '一百万个祝福⊙我有故事,你有酒吗？', '我的王八蛋', '玩儿鲨鱼的女人', '凭什么', '送你一只喵', '厦门爱情故事2007', '周三的情书', '铃铛', '小善缘后记'],
      },
      //同类书籍
      similarBook: [{
        bookName: "三生三世十里桃花",
        author: "唐七",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472252",
        imgUrl: "./img/1000008.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },
      {
        bookName: "十宗罪5",
        author: "蜘蛛",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540471682",
        imgUrl: "./img/1000013.jpg"
      },
      {
        bookName: "你所谓的稳定，不过是在浪费生命",
        author: "李尚龙",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787540474485",
        imgUrl: "./img/1000023.jpg"
      },
      {
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "云南新华大厦",
        address: "昆明市人民东路6号"
      },
      {
        libraryName: "新华书店学府大道店",
        address: "南昌市新建区学府大道219号"
      },
      {
        libraryName: "新华书店老福山购书中心",
        address: "江西省南昌市西湖区八一大道102号新华大厦"
      },
      {
        libraryName: "新华书店河西大学店",
        address: "长沙市麓山路303号"
      },
      {
        libraryName: "新华书店芙蓉中路店",
        address: " 湖南省长沙市芙蓉区芙蓉中路二段76号湖南图书城1-4层"
      },
      {
        libraryName: "新华书店长沙市分公司",
        address: "长沙市五一东路285号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "内蒙古图书馆",
        address: "内蒙古呼和浩特市赛罕区乌兰察布西街34号"
      },
      {
        libraryName: "湖南图书馆",
        address: "湖南省长沙市芙蓉区韶山北路157号"
      }
      ],
      comment: [{
        userName: "芥末蓝",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "第一次读大冰的书就深深的被大冰吸引了，完全控制不了自己。准备把其他的所有的大冰的书都买了，大冰，我爱你！"
      },
      {
        userName: "安如歌",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "不给大冰你这个野生作家满分，是怕你骄傲这本书是去年姐姐送的，兜兜转转一直没机会看。终于我在这个酷暑把它看完了。我没有在火车上，我也没有在地铁上，我也没有斜倚在床头，也没有在洒满阳光的书桌前，更没有在异乡街头或者航班被延误的候机厅里看这本书。大热天的，吹着一个二十年前的退休老干部级别的电扇，我坐在闺密家铺着毛毯的沙发上缩在角落里，趁着微弱的光芒看完了这本书。我想我一辈子都会记得我第一次看书看到了长痱子。我喜欢这本书，我一定也会喜欢上另外两本书。爱上了民谣，也更爱异乡。但是每天有新想法新发现，哪里不是异乡。大冰，阿弥陀佛。"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "阿弥陀佛，么么哒。是我买的大冰的第一本书，里面的故事真的挺打动人心的，不论是患白血病的小男孩还是张晏明的《佳佳》都让人为之动容。书中真实的记录着他经历的故事，从朋友到民谣歌手，甚至只是来小屋的路人，所有有机会成为故事的主人。"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "因为阅读《阿弥陀佛么么哒》想去一次你与小师姐认识的小镇，大抵是因为心中有期待，期待会遇见不同的故事。感谢《阿弥陀佛么么哒》给我一场不一样的修行，满满地正能量?期待大冰会推出新作?缘深缘浅，缘聚缘散，惜缘随缘莫攀缘?"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: " 大冰的新书，果断买来一口气看完，12个真实的故事，看的我是一会哭一会笑的，跟个神经病一样，好久没有被感动的湿润眼球了，阿弥陀佛，么么哒！那个给“希有”的卡片已经写好了，坐等大冰的微博炮弹，真实的故事总是让人动容，这本书很值得一看。,有趣的书籍,小朋友喜欢看"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: " 此书于书展相识，结缘于当当网。温情感人，纸巾拭泪。于是又结缘了大冰的其他几本书籍。我亦是信佛之人，阿弥陀佛么么哒！"
      }
      ]
    },


    //第三本书
    {
      //书的信息
      BookInformation: {
        bookName: "毛泽东思想和中国特色社会主义理论体系概论",
        author: "《毛泽东思想和中国特色社会主义理论体系概论》编写组",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        price: "25.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787040432022",
        imgUrl: "./img/1000003.jpg",
        authorIntro: "编写组在编写过程中，参阅了大量的教材、著作和文献，吸收、借鉴国内外很多专家学者的研究成果，得到经济科学出版社的理解和大力支持",
        //图书标签
        bookLabel: ['专业教材', '权威指导', '指定用书',],
        //主题词
        themaWords: ['教材', '政治'],
        //内容提要
        contentSummary: '《(2015年)马克思主义理论研究和建设工程重点教材:*思想和中国特色社会主义理论体系概论(修订版)》分为12章：第一章马克思主义中国化两大理论成果；第二章新民主主义革命理论；第三章社会主义改造理论；第四章社会主义建设道路初步探索的理论成果；第五章建设中国特色社会主义总依据；第六章社会数以本质和建设中国特色社会主义总任务；第七章社会主义改革开放理论；第八章建设中国特色社会主义总布局；第九章实现祖国完全统一的理论；第十章中国特色社会主义外交和国际战略；第十一章建设中国特色社会主义的根本目的和依靠力量理论；第十二章中国特色社会主义领导核心理论。',
        //本书目录
        catalogues: ['第一章马克思主义中国化两大理论成果', '第一节马克思主义中国化及其发展一', '马克思主义中国化的提出二', '马克思主义中国化的科学内涵三', '马克思主义中国化两大理论成果的关系', '第二节毛泽东思想一', '毛泽东思想的形成和发展二', '毛泽东思想的主要内容三', '毛泽东思想的历史地位第三节中国特色社会主义理论体系一', '中国特色社会主义理论体系的形成和发展二', '中国特色社会主义理论体系的主要内容三', '中国特色社会主义理论体系的历史地位']
      },
      //同类书籍
      similarBook: [{
        bookName: "2015年修订版马克思主义基本原理概论",
        author: "《马克思主义基本原理概论》编写组",
        press: "高等教育出版社有限公司",
        year: "2015-08",
        ISBN: "9787040431971",
        imgUrl: "./img/1000030.jpg"
      },
      {
        bookName: "全国英语等级考试标准教程（全新版）",
        author: "本书编写组",
        press: "高等教育出版社有限公司",
        year: "2011-07",
        ISBN: "9787040302981",
        imgUrl: "./img/1000014.jpg"
      },
      {
        bookName: "读论语 学成语",
        author: "韩兴娥,徐美华",
        press: "中文天地出版股份有限公司",
        year: "2015-06",
        ISBN: "9787210074199",
        imgUrl: "./img/1000043.jpg"
      },
      {
        bookName: "你所谓的稳定，不过是在浪费生命",
        author: "李尚龙",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787540474485",
        imgUrl: "./img/1000023.jpg"
      },
      {
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "新华书店人民北路店",
        address: "成都市成华西街8号图书音像批发市场3楼C区25-39号"
      },
      {
        libraryName: "新华书店学府大道店",
        address: "南昌市新建区学府大道219号"
      },
      {
        libraryName: "崇文书城",
        address: "武汉市洪山区雄楚大道268号"
      },
      {
        libraryName: "上海书城福州店",
        address: "上海市黄浦区福州路465号世纪出版大厦"
      },
      {
        libraryName: "上海书城353广场店",
        address: " 上海市黄浦区南京东路353号悦荟mosaicF5"
      },
      {
        libraryName: "新华书店长沙市分公司",
        address: "长沙市五一东路285号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "上海图书馆",
        address: "上海市徐汇区淮海中路1555号"
      },
      {
        libraryName: "湖南图书馆",
        address: "湖南省长沙市芙蓉区韶山北路157号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "重温毛概理论，国家发展的脉络清晰，展示了国家发展过程中的各种思想"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "内容是正规的，文字是正确的！可以购买！"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "十成新书，纸质好，文字清晰"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "4月份考试用，还不错"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: " 资料全面，讲解细致入心。正版，性价比高。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: " 本科就剩这一门了，希望能顺利通过"
      }
      ]
    },


    //第四本书
    {
      //书的信息
      BookInformation: {
        bookName: "摆渡人(精装插图纪念版)",
        author: "[英]克莱儿·麦克福尔",
        press: "中文天地出版股份有限公司",
        year: "2016-089",
        price: "58.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787550016903",
        imgUrl: "./img/1000004.jpg",
        authorIntro: "克莱儿·麦克福尔：居住在苏格兰格拉斯哥南部，是英国文坛备受瞩目的实力作家。她的作品往往在出其不意的情节架构中饱含感人至深的真情，贯穿着人生思索和人性独白",
        //图书标签
        bookLabel: ['经典必读', '情节曲折', '引人入胜',],
        //主题词
        themaWords: ['文学', '外国文学'],
        //内容提要
        contentSummary: '单亲女孩迪伦，15岁的世界一片狼藉：与母亲总是无话可说，在学校里经常受到同学的捉弄，*谈得来的好友也因为转学离开了。这一切都让迪伦感到无比痛苦。她决定去看望久未谋面的父亲，然而，路上突发交通事故。等她拼命爬出火车残骸之后，却惊恐地发现，自己是*的幸存者，而眼前，竟是一片荒原。此时，迪伦看到不远处的山坡上一个男孩的身影。男孩将她带离了事故现场。但是，迪伦很快意识到，男孩并不是偶然出现的路人，他似乎是特意在此等候。命运，从他们相遇的那刻开始，发生了无法预料的转变……这是一个史诗般的动人故事，它令人激奋、恐惧、温暖，回归人性，引人深思。',
        //本书目录
        catalogues: ['　现在身边堆满了那位瞪眼女士的袋子，迪伦费劲地把手探进口袋，取出了手机，开始写短信—爸，我在车上。没有晚点太久。等不及了想见你。迪伦。在她按下发送键时，窗外一片漆黑。好长的一条隧道，她想。手机是琼用加班费给她买的昂贵圣诞礼物。现在手机屏幕上一直滚动着“发送中”的字样。这行文字滚动了三次之后，手机发出了嘟嘟两声提示：发送失败。“浑蛋！”迪伦不禁低声骂了一句。她有些荒唐地努力把手机举到头顶，尽管自己也知道这样做无济于事。他们现在还在隧道中，手机信号不可能穿透那么厚的岩石。她的手臂高举在空中，像一个微型的自由女神像。当那件事发生时，她还保持着这个姿势。灯光熄灭了，声音炸裂了，世界终结了。一片死寂。应该有尖叫声啊、哭喊声啊，总该有点动静吧。迪伦想。但是周围只有死寂。'],
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "时代广场的蟋蟀",
        author: "(美)威廉姆斯 绘;(美)乔治.塞尔登",
        press: "中文天地出版股份有限公司",
        year: "2013-08",
        ISBN: "9787539189437",
        imgUrl: "./img/1000001.jpg"
      },
      {
        bookName: "读论语 学成语",
        author: "韩兴娥,徐美华",
        press: "中文天地出版股份有限公司",
        year: "2015-06",
        ISBN: "9787210074199",
        imgUrl: "./img/1000043.jpg"
      },
      {
        bookName: "你所谓的稳定，不过是在浪费生命",
        author: "李尚龙",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787540474485",
        imgUrl: "./img/1000023.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "新华书店长沙市分公司",
        address: "长沙市五一东路285号"
      },
      {
        libraryName: "新华书店芙蓉中路店",
        address: "湖南省长沙市芙蓉区芙蓉中路二段76号湖南图书城1-4层"
      },
      {
        libraryName: "新华书店河西大学店",
        address: "长沙市麓山路303号"
      },
      {
        libraryName: "新华书店老福山购书中心",
        address: "江西省南昌市西湖区八一大道102号新华大厦"
      },
      {
        libraryName: "新华书店学府大道店",
        address: " 南昌市新建区学府大道219号"
      },
      {
        libraryName: "新华书店江汉路店",
        address: "汉口中山大道896号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "湖北省图书馆",
        address: "武汉市武昌区公正路25号"
      },
      {
        libraryName: "湖南图书馆",
        address: "湖南省长沙市芙蓉区韶山北路157号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "讲的是迪伦和催斯坦的爱情故事，这是一条明线。这里面夹杂着对生命的某个方面的思考，比如说，人情的冷暖，比如说，理智与情感矛盾时，怎样选择，这是一个问题。小说以一种变化的笔调大概描绘了大部分人都可能会做的梦吧。至少我看的时候，那些场景似乎经历过，感受过。"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "这本一直稳居畅销排行榜的书，犹豫了很久才买，因为实在受够了“心灵治愈”、“灵魂震颤”、“人性救赎”之类的营销套路。我把它归纳为一个“西方玄幻爱情故事”，读后挺暖心，但想靠它治愈、救赎的就歇了吧。"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "很久没有看小说了，这本小说真的很不错，必须说崔斯坦是迪伦的摆渡人，不如说迪伦是崔斯坦的摆渡人，以及接受自己死亡信息的那种淡定，从容都让我觉得很吃惊。爱就是相互摆渡相互慰藉，在任何困难的日子里。我也愿意成为别人的摆渡人。"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "没有想到的，毫无预期的死亡，再到启程前往荒野。迪伦遭遇到了人生中最大的变故，可这次的摆渡，也让她受到了最真挚的感情。我喜欢迪伦的天真浪漫，也羡慕她毅然逆行荒野的勇敢，迪伦身上折射出了太多的我们，用心感受，也许你能找到那个最初的自己。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: " 在整个作品中，看起来崔斯坦是迪伦的摆渡人。而其实真正的摆渡人是迪伦自己。这是治愈心灵的小说，那最后结果当然是穿越成功。崔斯坦在迪伦的摆渡下，成功到了迪伦的“人”世界。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: " 迪伦和崔斯坦的爱，可谓轰轰烈烈，跨越了生死，赋予了崔斯坦生命以及迪伦自己的新生。很多时候，我都在怀疑自己的付出与爱的收获是否值得。但是看了摆渡人，内心无比感恩目前所收获的一切。"
      }
      ]
    },



    //第五本书
    {
      //书的信息
      BookInformation: {
        bookName: "施工员岗位知识与专业技能（土建方向）",
        author: "建筑与市政工程施工现场专业人员职业标准培训教材编审委员会",
        press: "中国建筑工业出版社",
        year: "2013-09",
        price: "45.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787550016903",
        imgUrl: "./img/1000005.jpg",
        authorIntro: "编审委员会参考了很多文献和实地实验,完成了《施工员岗位知识与专业技能》",
        //图书标签
        bookLabel: ['专业教材', '权威认证', '细致',],
        //主题词
        themaWords: ['教材', '建筑'],
        //内容提要
        contentSummary: '本书是根据中华人民共和国住房和城乡建设部颁布的《建筑与市政工程施工现场专业人员职业标准》JGJ／T2502011和建筑与市政工程施工员(土建方向)考核评价大纲编写的，与《施丁员通用与基础知识》一书配套使用。*谈得来的好友也因为转学离开了。这一切都让迪伦感到无比痛苦。她决定去看望久未谋面的父亲，然而，路上突发交通事故。等她拼命爬出火车残骸之后，却惊恐地发现，自己是*的幸存者，而眼前，竟是一片荒原。此时，迪伦看到不远处的山坡上一个男孩的身影。男孩将她带离了事故现场。但是，迪伦很快意识到，男孩并不是偶然出现的路人，他似乎是特意在此等候。命运，从他们相遇的那刻开始，发生了无法预料的转变……这是一个史诗般的动人故事，它令人激奋、恐惧、温暖，回归人性，引人深思。',
        //本书目录
        catalogues: ['上篇　岗位知识一、土建施工相关的管理规定和标准(一)施工现场安全生产的管理规定(二)建筑工程质量管理的规定(三)建筑工程质量验收标准和规范二、施工组织设计及专项施工方案的编制(一)施工组织设计的内容和编制方法(二)施工方案的内容和编制方法(三)施工技术交底与交底文件的编写方法(四)建筑工程施工技术要求三、施工进度计划的编制(一)施王进度计划的类型及其作用(二)施工进度计划的表达方法']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "时代广场的蟋蟀",
        author: "(美)威廉姆斯 绘;(美)乔治.塞尔登",
        press: "中文天地出版股份有限公司",
        year: "2013-08",
        ISBN: "9787539189437",
        imgUrl: "./img/1000001.jpg"
      },
      {
        bookName: "读论语 学成语",
        author: "韩兴娥,徐美华",
        press: "中文天地出版股份有限公司",
        year: "2015-06",
        ISBN: "9787210074199",
        imgUrl: "./img/1000043.jpg"
      },
      {
        bookName: "你所谓的稳定，不过是在浪费生命",
        author: "李尚龙",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787540474485",
        imgUrl: "./img/1000023.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "上海书城福州店",
        address: "上海市黄浦区福州路465号世纪出版大厦"
      },
      {
        libraryName: "上海书城长宁店",
        address: "上海市长宁路1057号"
      },
      {
        libraryName: "新华书店长沙市分公司",
        address: "长沙市五一东路285号"
      },
      {
        libraryName: "新华书店芙蓉中路店",
        address: "湖南省长沙市芙蓉区芙蓉中路二段76号湖南图书城1-4层"
      },
      {
        libraryName: "新华书店河西大学店",
        address: " 长沙市麓山路303号"
      },
      {
        libraryName: "新华书店长沙市分公司",
        address: "长沙市五一东路285号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "江西省图书馆",
        address: "江西省南昌市洪都北大道160号"
      },
      {
        libraryName: "湖北省图书馆",
        address: "武汉市武昌区公正路25号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "书的质量不是很好，外面有点皱了，里面有些字有污点"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "'很实用，也很全面！"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "很好用 考证可以做参考书"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "宝贝不错，值很实用"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: " 很好，物流也很快，正在准备买其他书籍。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: " 这个商品不错~"
      }
      ]
    },



    //第六本书
    {
      //书的信息
      BookInformation: {
        bookName: "三生三世十里桃花",
        author: "唐七",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        price: "35.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787540472252",
        imgUrl: "./img/1000008.jpg",
        authorIntro: " 唐七，曾用名唐七公子。四海为家，过闲散人生，写连篇梦话。作品：《华胥引》、《三生三世十里桃花》、《三生三世枕上书》系列、《岁月是朵两生花》等。",
        //图书标签
        bookLabel: ['言情', '文艺', '玄幻',],
        //主题词
        themaWords: ['玄幻', '小说'],
        //内容提要
        contentSummary: '那一世，大荒之中一处荒山，成就她与他的初见。桃花灼灼，枝叶蓁蓁，妖娆伤眼。记忆可以封存，可心有时也会背叛，忘得了前世情缘，忘不了桃林十里，亦忘不了十里桃林中玄衣的少年。',
        //本书目录
        catalogues: ['【前传】爱　恨　之　间【楔子】青　丘　白　浅【第一章】前　尘　往　事【第二章】蓦　然　重　逢【第三章】东　窗　事　发【第四章】心　有　灵　犀【第五章】大　紫　明　宫【第六章】鬼　族　之　乱【第七章】不　速　之　客【第八章】阿　离　生　辰【第九章】桃　花　孽　缘【第十章】两　生　咒　']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "十宗罪5",
        author: "蜘蛛",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540471682",
        imgUrl: "./img/1000013.jpg"
      },
      {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg"
      },
      {
        bookName: "你所谓的稳定，不过是在浪费生命",
        author: "李尚龙",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787540474485",
        imgUrl: "./img/1000023.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "新华书店人民北路店",
        address: "成都市成华西街8号图书音像批发市场3楼C区25-39号"
      },
      {
        libraryName: "新华书店武侯祠店",
        address: "成都市武侯区武侯祠大街266号华达商城1层"
      },
      {
        libraryName: "新华书店顺城店",
        address: "四川省成都市双流区顺城街3号"
      },
      {
        libraryName: "新华书店长沙市分公司",
        address: "长沙市五一东路285号"
      },
      {
        libraryName: "北京市西城区西长安街17号北京图书大厦",
        address: " 团结湖路7-2团结湖购物商场底商"
      },
      {
        libraryName: "云南新华大厦",
        address: "昆明市人民东路6号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "云南省图书馆",
        address: "云南省昆明市翠湖南路141号"
      },
      {
        libraryName: "江西省图书馆",
        address: "江西省南昌市洪都北大道160号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "决定授予唐七“最佳造梦师”的称号。作者有些才华，把三生三世十几万年的爱恋纠缠写得滴水不漏，鲜有逻辑硬伤。可是啊哈哈，四海八荒第一美女出生便是帝姬的上神白浅，天上地下第一俊的天族太子天才夜华，怎么就相互爱得那么死心塌地呢。这夜华，不仅武功超群，还会下厨，为白浅赴汤蹈火在所不辞，还对天上地下的一众仙女美女目不斜视，眼里只有一个她……这真是令观者各自着迷意淫的一对儿璧人！如此惊天地泣鬼神如此完美的爱情故事，我怎么就一点都不感动呢！或许是完美得太虚假了吧。"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "'十里桃花我有初版，有新版，这个纪念版当然也要买。七的书中我最爱的不十里桃花，但十里是三生系列的起点，纪念版里有七写的序，很是值得收藏。"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "早就跟朋友借来此书 却一直看不进去 放在家中落灰 起初不喜欢杨幂 后来剧荒 试着看一下电视剧 演技还真是大突破 电视剧上瘾了 小说翻出来看 看完后归还原主 我又来买本收藏 。"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "纯属收藏用，电视剧版的三生三世十里桃花拍得不错，对原著的忠诚度较高，深得大家的认同，要是以后拍的小说版电视剧都能按此标准就好了，也能少让原著粉吐槽。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: " 孩子极爱读书，从上学起就开始在当当网买书，看书买书快成了生活中不可或缺的一项重要内容。正好暑假时有电视剧在播，和原著比太弱了，还是看书比较好，虽然是杂书，但绝对精彩，不可不看。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: " 这本书真是复杂的心情。单就作品内容而言个人是很喜欢的，但是听说有抄袭嫌疑，去翻了翻调色盘，有些地方很牵强，但是有很多地方确实和桃花债内容很想似~"
      }
      ]
    },



    //第七本书
    {
      //书的信息
      BookInformation: {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        price: "36.80",
        Binding: "精装",
        folio: "32",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg",
        authorIntro: "卢思浩是中国新生代青年作家中*代表的人物。 留学八年，创业三年，去5个国家做过沙发客……比同龄人更丰富的经历造就了他写作独具一格的治愈风格。",
        //图书标签
        bookLabel: ['言情', '文艺', '玄幻',],
        //主题词
        themaWords: ['玄幻', '小说'],
        //内容提要
        contentSummary: '百万级销量青年作家卢思浩2015年新作《离开前请叫醒我》。 38个来自卢思浩和他身边朋友们的故事，关于友情、爱情、孤独和自我，他用日常生活中动人的故事告诉你，只要有光，无惧黑夜。书中讲述了卢思浩在墨尔本生活中遇到的形形色色的故事：包子曾为了一个人环游世界；捏捏曾面对梦想无数次想放弃；胡幽幽是个追演唱会的“狂人”',
        //本书目录
        catalogues: ['序言 多年以后，愿你我都能过得更像自己1.《离别时别回头》2.《他们看起来是在关心你，其实他们关心的只是自己》3.《你等的人，等你的人，都是懂你的那一个》4.《因为你自己喜欢》5.《未来太远，现下就是永远》6.《写给自己的生日》7.《冬天冷，吃碗热饺子》8.《热恋时我们都是段子手，失恋时我们都是矫情狗》9.《青春不怕岁月长》10.《愿赌服输》']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "十宗罪5",
        author: "蜘蛛",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540471682",
        imgUrl: "./img/1000013.jpg"
      },
      {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg"
      },
      {
        bookName: "你所谓的稳定，不过是在浪费生命",
        author: "李尚龙",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787540474485",
        imgUrl: "./img/1000023.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "云南新华大厦",
        address: "昆明市人民东路6号"
      },
      {
        libraryName: "新华书店内蒙古店",
        address: "内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
      },
      {
        libraryName: "新华书店老福山购书中心",
        address: "江西省南昌市西湖区八一大道102号新华大厦"
      },
      {
        libraryName: "新华书店人民北路店",
        address: "成都市成华西街8号图书音像批发市场3楼C区25-39号"
      },
      {
        libraryName: "新华书店长沙市分公司",
        address: " 长沙市五一东路285号"
      },
      {
        libraryName: "上海书城长宁店",
        address: "上海市长宁路1057号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "湖南图书馆",
        address: "湖南省长沙市芙蓉区韶山北路157号"
      },
      {
        libraryName: "四川省图书馆",
        address: "四川省成都市青羊区人民西路4号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "第一次看鸡汤就是卢思浩的,其实他的文字我不想称之为鸡汤,其实和他差不多的作者有很多，但是其他作者的书都看不进去，唯独只能仅爱他写的故事，我是爱看故事的人，而他恰好是写故事的人，我欣然接受这样的缘分。只要他一直写故事，我，就会一直看下去。"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "看完了，每个人都在经历着自己的故事。他们的故事另外开怀或令人悲伤。世界那么大，总有人在经历这一些你不知道的故事。他们的故事触动这些，也许这些你也曾经经历过，也许正在经历，但不管怎么，未来还在，还是要继续走。"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "书本好厚，比前两本kevin的书要厚不少，纸质也超棒，包括配的插图等很有感觉，粗略看了几页，个人非常喜欢这类文字，kevin的书一如既往支持，当时想要预定的，拖到现在才买，果然没让我失望，可惜没有随机赠送到语录集，不过还是很满意啦～"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "非常喜欢卢思浩，本来就觉得他是个非常文艺的作家，他的每一本书都非常励志感人，身为一个准高三的孩子我每次看完他的书都会变得非常有冲劲有动力，真的很喜欢卢思浩。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "卢思浩的书总是让我舍不得结束 成长的路程需要卢思浩的陪伴"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "很好看，喜欢卢思浩的文章故事，随便翻开一篇都可以看下去"
      }
      ]
    },



    //第八本书
    {
      //书的信息
      BookInformation: {
        bookName: "乒乒和乓乓钓大鱼(精)",
        author: "宫西达也 文/图，熊春，蒲蒲兰　译",
        press: "中文天地出版股份有限公司",
        year: "2007-106",
        price: "32.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787539139340",
        imgUrl: "./img/1000012.jpg",
        authorIntro: "1956年12月23日出生于日本静冈县，毕业于日本大学艺术学部美术系。从事人偶剧的舞台美术、平面设计工作后，开始绘本创作。其温馨的故事和有力度的画风受到孩子和成人的广泛欢迎，是目前最活跃的日本绘本作家之一。",
        //图书标签
        bookLabel: ['儿童文学', '文艺', '绘图',],
        //主题词
        themaWords: ['卡通', '儿童'],
        //内容提要
        contentSummary: '乒乒和乓乓是好朋友。他们一起去钓鱼。很快，乒乒的鱼竿动了，可是扑通一声鱼跑了。好大的一条鱼哦，乒乒觉得很可惜。“才不是呢！是条很小的鱼！”乓乓说。这时候，乓乓的鱼竿也动了，可扭来扭去章鱼逃走了。好大的一条章鱼哦，乓乓觉得很可惜，！“才不是呢！是条很小的章鱼！”乒乒说。两个好朋友继续钓鱼，他们的鱼竿接连不断地动起来，都钓到什么鱼了呢？',
        //本书目录
        catalogues: ['1. 两只小企鹅','2. 乒乒和乓乓','3. 乒乒和乓乓钓大鱼']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "十宗罪5",
        author: "蜘蛛",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540471682",
        imgUrl: "./img/1000013.jpg"
      },
      {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg"
      },
      {
        bookName: "你所谓的稳定，不过是在浪费生命",
        author: "李尚龙",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787540474485",
        imgUrl: "./img/1000023.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "上海书城福州店",
        address: "上海市黄浦区福州路465号世纪出版大厦"
      },
      {
        libraryName: "上海书城353广场店",
        address: "上海市黄浦区南京东路353号悦荟mosaicF5"
      },
      {
        libraryName: "崇文书城",
        address: "武汉市洪山区雄楚大道268号"
      },
      {
        libraryName: "新华书店江汉路店",
        address: "汉口中山大道896号"
      },
      {
        libraryName: "新华书店街道口门市部",
        address: " 洪山区武珞路800号"
      },
      {
        libraryName: "新华书店长沙市分公司",
        address: "长沙市五一东路285号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "上海图书馆",
        address: "上海市徐汇区淮海中路1555号"
      },
      {
        libraryName: "湖北省图书馆",
        address: "武汉市武昌区公正路25号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "宫西达也的书一直都在买，很好，孩子特别喜欢看！"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "很喜欢宫西达也的书，孩子们真的很喜欢他的绘本，简单、幽默、讲完一遍印象深刻，而且还可回味"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "宫西达也的超级粉丝，他的每部作品都超级有趣"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "宫西达也的书，都值得收，两个好基友的友情绘本，很有爱，又好玩，娃很喜欢!"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "这本宫西达也大叔的书也不错。四岁的孩子可看，稍简单。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "讲过三次左右和宫西达也其他几本书比起来这本书讲的次数算比较少的"
      }
      ]
    },




    //第九本书
    {
      //书的信息
      BookInformation: {
        bookName: "十宗罪5",
        author: "蜘蛛",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        price: "35.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787540471682",
        imgUrl: "./img/1000013.jpg",
        authorIntro: "十宗罪是作家蜘蛛写的系列悬疑小说，书籍根据真实案例改编而成，涉案地名人名均为化名",
        //图书标签
        bookLabel: ['犯罪', '悬疑', '推理',],
        //主题词
        themaWords: ['小说', '刑侦'],
        //内容提要
        contentSummary: '善与恶，在较量中我们将付出多大的代价？　罪与罚，从来都是人性中不可或缺的话题。　绝对震撼的角色安排：四个超级警察，各怀绝技，从全国警察队伍中挑选而出，组成中国特案组，对各地发生的特大罪案进行侦破。',
        //本书目录
        catalogues: ['第一卷 恐怖衣柜','第二卷 人彘奇案','第三卷 清醒一梦','第四卷 公园恶魔','第五卷 恋童癖者','第六卷 凋零之案']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "三生三世十里桃花",
        author: "唐七",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472252",
        imgUrl: "./img/1000008.jpg"
      },
      {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg"
      },
      {
        bookName: "你所谓的稳定，不过是在浪费生命",
        author: "李尚龙",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787540474485",
        imgUrl: "./img/1000023.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },

      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "云南新华大厦",
        address: "昆明市人民东路6号"
      },
      {
        libraryName: "新华书店内蒙古店",
        address: "内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
      },
      {
        libraryName: "新华书店老福山购书中心",
        address: "江西省南昌市西湖区八一大道102号新华大厦"
      },
      {
        libraryName: "新华书店顺城店",
        address: "四川省成都市双流区顺城街3号"
      },
      {
        libraryName: "新华书店芙蓉中路店",
        address: " 湖南省长沙市芙蓉区芙蓉中路二段76号湖南图书城1-4层"
      },
      {
        libraryName: "新华书店街道口门市部",
        address: "洪山区武珞路800号"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "云南省图书馆",
        address: "云南省昆明市翠湖南路141号"
      },
      {
        libraryName: "江西省图书馆",
        address: "江西省南昌市洪都北大道160号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "这是蜘蛛出的第六本书 也就是今年刚出的 我看到而且又有搞活动的 所以就买了感觉还不错"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "之前买过十宗罪的整套书，儿子觉得不过瘾，又买了这本诠释"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "很喜欢这个系列的书"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "这本书是我老公喜欢看的 他就喜欢看这些悬疑恐怖的小说 买回来很快就看完了 据说是情节挺好看的 推荐一下"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "故事的每一章节前面有一些作家的名言，深奥而有哲理，比如：追影子的人，自己就是影子（荷马）。十宗罪6里面有三个故事，作者蜘蛛?别有用心的让特案组组员都分开办案了，故事内容扣人心弦"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "比起前几部略微逊色，但是人性的弱点仍然很清晰。"
      }
      ]
    },



    //第十本书
    {
      //书的信息
      BookInformation: {
        bookName: "新视野大学英语(3)(视听说教程)",
        author: "郑树棠",
        press: "外语教学与研究出版社",
        year: "2015-06",
        price: "42.90",
        Binding: "精装",
        folio: "32",
        ISBN: "9787513556835",
        imgUrl: "./img/1000018.jpg",
        authorIntro: "新视野大学英语综合训练(2第2版普通高等教育十一五***规划教材)》(总主编郑树棠)是《新视野大学英语》(第二版)系列教材之一，与《读写教程》配套使用。本分册结合《读写教程》的修订，根据《大学英语课程教学要求》的精神进行了重新编写",
        //图书标签
        bookLabel: ['英语', '专业教材', '权威',],
        //主题词
        themaWords: ['教材', '英语'],
        //内容提要
        contentSummary: '《新视野大学英语：视听说教程（3 第3版 附光盘）》依据我国高等教育改革发展的新形势，针对国家、社会、个人对于英语课程的新需求，全新设计、全新编写而成。',
        //本书目录
        catalogues: ['Section A', 'Text:Love Without Limitations','Exercises','Section B','Reading Skills:Scanning','Text:The Framework for Love']
      },
      //同类书籍
      similarBook: [{
        bookName: "商务英语视听说",
        author: "李毅",
        press: "外语教学与研究出版社",
        year: "2013-05",
        ISBN: "9787560086644",
        imgUrl: "./img/1000038.jpg"
      },
      {
        bookName: "新视野英语教程(第三版)(读写教程）",
        author: "郑树棠，胡全生",
        press: "外语教学与研究出版社",
        year: "2014-06",
        ISBN: "9787513541886",
        imgUrl: "./img/1000044.jpg"
      },
      {
        bookName: "二年级 看图写话就三步 从20字到200字",
        author: "小铅笔作文研究中心",
        press: "人民邮电出版社",
        year: "2015-04",
        ISBN: "9787115384416",
        imgUrl: "./img/1000045.jpg"
      },
      {
        bookName: "外研通点读笔VT-2118（RE版）",
        author: "本书编写组",
        press: "外语教学与研究出版社",
        year: "2015-04",
        ISBN: "9787894208590",
        imgUrl: "./img/404.svg"
      },
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "新华书店河西大学店",
        address: "长沙市麓山路303号"
      },
      {
        libraryName: "新华书店长沙市分公司",
        address: "长沙市五一东路285号"
      },
      {
        libraryName: "崇文书城",
        address: "武汉市洪山区雄楚大道268号"
      },
      {
        libraryName: "上海书城353广场店",
        address: "上海市黄浦区南京东路353号悦荟mosaicF5"
      },
      {
        libraryName: "云南新华大厦",
        address: " 昆明市人民东路6号"
      },
      {
        libraryName: "新华书店内蒙古店",
        address: "内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "云南省图书馆",
        address: "云南省昆明市翠湖南路141号"
      },
      {
        libraryName: "内蒙古图书馆",
        address: "内蒙古呼和浩特市赛罕区乌兰察布西街34号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "这个商品不错~"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "好感觉，全5满分"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "是很好的学习英语的联系"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "结构合理"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "讲解的很全面，很有用"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "当当网买书值得信赖"
      }
      ]
    },



    //的十一本书
    {
      //书的信息
      BookInformation: {
        bookName: "论语解读/周读书系",
        author: "(春秋)孔子 撰;黄朴民 译注",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        price: "15.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787553804910",
        authorIntro: "黄朴民，中国人民大学国学院教授、执行院长，兼任中国史学会理事兼副秘书长、《国学学刊》执行主编。",
        imgUrl: "./img/1000022.jpg",
        //图书标签
        bookLabel: ['国学', '论语', '孔子'],
        //主题词
        themaWords: ['教辅', '古代文学'],
        //内容提要
        contentSummary: '《论语》是儒家学派的经典著作之一，由孔子的弟子及其再传弟子编撰而成。黄朴民译注的《论语解读/周读书系》以语录体和对话文体为主，记录了孔子及其弟子言行，集中体现了孔子的政治主张、伦理思想、道德观念及教育原则等。',
        //本书目录
        catalogues: ['学而第一为政第二八佾第三里仁第四公冶长第五雍也第六述而第七泰伯第八子罕第九乡党第十先进第十一颜渊第十二子路第十三宪问第十四卫灵公第十五季氏第十六阳货第十七微子第十八子张第十九尧日第二十']
      },
      //同类书籍
      similarBook: [{
        bookName: "商务英语视听说",
        author: "李毅",
        press: "外语教学与研究出版社",
        year: "2013-05",
        ISBN: "9787560086644",
        imgUrl: "./img/1000038.jpg"
      },
      {
        bookName: "新视野英语教程(第三版)(读写教程）",
        author: "郑树棠，胡全生",
        press: "外语教学与研究出版社",
        year: "2014-06",
        ISBN: "9787513541886",
        imgUrl: "./img/1000044.jpg"
      },
      {
        bookName: "二年级 看图写话就三步 从20字到200字",
        author: "小铅笔作文研究中心",
        press: "人民邮电出版社",
        year: "2015-04",
        ISBN: "9787115384416",
        imgUrl: "./img/1000045.jpg"
      },
      {
        bookName: "外研通点读笔VT-2118（RE版）",
        author: "本书编写组",
        press: "外语教学与研究出版社",
        year: "2015-04",
        ISBN: "9787894208590",
        imgUrl: "./img/404.svg"
      },
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "新华书店长沙市分公司",
        address: "长沙市五一东路285号"
      },
      {
        libraryName: "新华书店芙蓉中路店",
        address: "湖南省长沙市芙蓉区芙蓉中路二段76号湖南图书城1-4层"
      },
      {
        libraryName: "新华书店人民北路店",
        address: "成都市成华西街8号图书音像批发市场3楼C区25-39号"
      },
      {
        libraryName: "新华书店武侯祠店",
        address: "成都市武侯区武侯祠大街266号华达商城1层"
      },
      {
        libraryName: "新华书店顺城店",
        address: "四川省成都市双流区顺城街3号"
      },
      {
        libraryName: "新华书店老福山购书中心",
        address: "江西省南昌市西湖区八一大道102号新华大厦"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "四川省图书馆",
        address: "四川省成都市青羊区人民西路4号"
      },
      {
        libraryName: "江西省图书馆",
        address: "江西省南昌市洪都北大道160号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "论语解读我是现在图书馆借了阅读，觉得非常好，才决定购买收藏用来时时翻读的~"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "不亦乐乎，你解释的不对，亦字无须翻译成“也”。中华书局的书值得信赖，买时从来不问价，只要封面有感觉，内容没得说！还会买买买！"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "解读论语的著作中比较好的一本。看书的同时结合自己的亲身经历和现实情况进行思考，你会收获很多。给自己买了一本，另买了三本送人，以后说不定还会买。"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "质量真的不错，就是买了之后孩子学校又发了一本，哎！"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "这个版本的很好，买了6本了，5本送人，1本留给自己。这本书值得一生研读……"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "书挺厚的，纸质也很好，印刷清楚，注释，解读也很多，送货速度也行，总之很不错！"
      }
      ]
    },



    //第十二本书
    {
      //书的信息
      BookInformation: {
        bookName: "你所谓的稳定，不过是在浪费生命",
        author: "李尚龙",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        price: "38.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787540474485",
        imgUrl: "./img/1000023.jpg",
        authorIntro: "青年导演、作家、前新东方老师",
        //图书标签
        bookLabel: ['文学', '励志', '小说',],
        //主题词
        themaWords: ['小说', '现代文学'],
        //内容提要
        contentSummary: '     本书是继百万畅销书《你只是看起来很努力》后，中国优质新偶像李尚龙写给所有怀揣梦想、逆风奔跑的年轻人的激励之书。不要为了*丢掉生活，为了稳定丢掉青春，为了平淡丢掉梦想，因为你所谓的稳定，不过是在浪费生命。',
        //本书目录
        catalogues: ['序　言ONE你所谓的稳定，不过是在浪费生命TWO只要没被世界改变，就改变了世界THREE讲些故事，为了让你相信爱情']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "三生三世十里桃花",
        author: "唐七",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472252",
        imgUrl: "./img/1000008.jpg"
      },
      {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg"
      },
      {
        bookName: "论语解读/周读书系",
        author: "(春秋)孔子 撰;黄朴民 译注",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787553804910",
        imgUrl: "./img/1000022.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "新华书店内蒙古店",
        address: "内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
      },
      {
        libraryName: "新华书店江汉路店",
        address: "汉口中山大道896号"
      },
      {
        libraryName: "新华书店街道口门市部",
        address: "洪山区武珞路800号"
      },
      {
        libraryName: "上海书城长宁店",
        address: "上海市长宁路1057号"
      },
      {
        libraryName: "上海书城353广场店",
        address: "上海市黄浦区南京东路353号悦荟mosaicF5"
      },
      {
        libraryName: "上海书城福州店",
        address: "上海市黄浦区福州路465号世纪出版大厦"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "上海图书馆",
        address: "上海市徐汇区淮海中路1555号"
      },
      {
        libraryName: "湖北省图书馆",
        address: "武汉市武昌区公正路25号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "和李尚龙以前是同行，教雅思，那种排课排到多得抓狂，上课上得想吐的感觉真的是太疲惫了！很佩服他的毅力和斗志！更佩服于他敢于挑战不同的领域，感觉突破自我！大多数选择一份工作就是一条路走到头！他知道另辟蹊径，很难得！"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "别在最能拼搏的年纪选择了稳定，更别觉得这世界有什么稳定的工作，你现在的享福都是假象，都会在以后日子里还给你，生活是自己的，奋斗也不是为了别人，拼搏也是每天必做的事情，只有每天进步才是最稳定的生活。"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "纸质排版各方面都不错，一直疑惑这本书的名字，作者来学校宣传时说他一直想用的名字是《你所谓的稳定》，这样就可以理解了！稳定不能说是浪费，只是这个急剧变化的世界，哪有一直的稳定，适者生存，我们得随时做好变换轨道的准备。"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "非常棒的一本书，一个个故事让人深省、也让人感动，书的内容远比它的书名要丰富。人生没有答案，但不能没有故事，一个好故事可以改变一个人，书中有不少这样充满正能量的动人故事。希望更多的人能读这本书"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "数次给朋友推荐了这本书，有幸在河师大聆听过李尚龙老师的英语讲座，后来得知他写书了，就买了回来。先是《你只是看起来很努力》，然后是这本的《你所谓的稳定，不过是在浪费生命》，但个人感觉这本书要比前一本好！"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "我觉得现在很多年轻人都渴望稳定，到底浪不浪费生命，只能看具体事物了"
      }
      ]
    },



    //第十三本书
    {
      //书的信息
      BookInformation: {
        bookName: "老鼠娶新娘（再版）",
        author: "张玲玲",
        press: "中文天地出版股份有限公司",
        year: "2008-01",
        price: "32.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787539140629",
        imgUrl: "./img/1000029.jpg",
        authorIntro: "张玲玲，1954年出生于台湾台北。东吴大学日文系毕业，曾于日本筑波大学专攻民间故事。现在从事台湾本土儿童文学的编辑工作。",
        //图书标签
        bookLabel: ['儿童文学', '卡通', '绘图',],
        //主题词
        themaWords: ['卡通', '儿童文学'],
        //内容提要
        contentSummary: '老鼠村长的女儿要抛绣球选新郎，一只黑猫冲进来搅乱了局面。为了女儿的幸福，老鼠村长决定找一个比猫还强、全世界*强的女婿。左思右想，他觉得太阳是全世界*强的，于是跑去找太阳。可是乌云遮住了太阳，风吹散了乌云，墙挡住了风……到底谁才是全世界*强呢？',
        //本书目录
        catalogues: ['第一章 老鼠村长','第二章 抛绣球','第三章 选新郎']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "三生三世十里桃花",
        author: "唐七",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472252",
        imgUrl: "./img/1000008.jpg"
      },
      {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg"
      },
      {
        bookName: "论语解读/周读书系",
        author: "(春秋)孔子 撰;黄朴民 译注",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787553804910",
        imgUrl: "./img/1000022.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "云南新华大厦",
        address: "昆明市人民东路6号"
      },
      {
        libraryName: "新华书店内蒙古店",
        address: "内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
      },
      {
        libraryName: "新华书店学府大道店",
        address: "南昌市新建区学府大道219号"
      },
      {
        libraryName: "新华书店老福山购书中心",
        address: "江西省南昌市西湖区八一大道102号新华大厦"
      },
      {
        libraryName: "新华书店顺城店",
        address: "四川省成都市双流区顺城街3号"
      },
      {
        libraryName: "新华书店武侯祠店",
        address: "成都市武侯区武侯祠大街266号华达商城1层"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "江西省图书馆",
        address: "江西省南昌市洪都北大道160号"
      },
      {
        libraryName: "内蒙古图书馆",
        address: "内蒙古呼和浩特市赛罕区乌兰察布西街34号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "这本书和别的绘本不一样的地方就是整个画面都是热热闹闹的红，和漂漂亮亮的古代建筑，加上故事的趣味性，我好喜欢这本绘本。"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "非常美好又充满乡土味的一套书。如果说《梁山伯与祝英台》是阳春白雪的爱情，那么这本《老鼠娶新娘》就是下里巴人的爱情。图画非常细腻，画面美好精致又热闹，充满喜感。翻开书就能把人带回那个单纯又美好的，充满乡土味的小时候。"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "三十多岁的人了，突然超级喜欢看绘本，打着女儿的旗号买买！！！初拿到手感觉薄薄的，但读起来篇幅还是可以的！书中有文字说明，方便深入理解图意！好的绘本认真读起来比文字书看得时间长！"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "5岁+的女孩很喜欢这个故事，里面的童谣（小白菜，地里黄。老鼠村，老村长。村长女儿美叮当。。。。。。）朗朗上口，小朋友说的很溜。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "买回来讲了一遍宝宝就记住了一些情节，看到乌云就说风是最厉害的，因为会把云吹走。。。好欣慰，后来拿到幼儿园，其他小朋友也喜欢。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "一个代代相传的民间故事生动的传说故事，动听的民间童谣，久远的娶亲习俗和精致细腻的画面构成了本书强烈的民间和中国特色。在阅读中了解传统与文化体会寓意与幽默欣赏画面与细节。"
      }
      ]
    },




    //第十四本书
    {
      //书的信息
      BookInformation: {
        bookName: "我要做一个阳刚男孩(拼音彩绘版)",
        author: "彭凡",
        press: "中文天地出版股份有限公司",
        year: "2016-09",
        price: "35.00",
        Binding: "精装",
        folio: "32",
        ISBN: "9787122267245",
        imgUrl: "./img/1000063.jpg",
        authorIntro: "彭凡少儿阅读推广人，“冰心儿童文学奖”获得者",
        //图书标签
        bookLabel: ['儿童文学', '卡通', '绘图',],
        //主题词
        themaWords: ['卡通', '儿童文学'],
        //内容提要
        contentSummary: '本书以孩子喜爱的几种动物来比喻男孩成长过程应该培养的性格，包含了100个精彩有趣的故事，其中有聪明伶俐、敦厚善良、自立自强、勤劳刻苦、勇敢无畏、坚持不懈等品质，通过故事给孩子以启发，让孩子健康成长！本书配有拼音，并有精美插图，适合4-10岁孩子阅读，引导孩子自主阅读。故事后的“大明星的话”点明了故事的主题，分享人生智慧，让孩子获得成长的力量，从而做更好更的自己，而阅读本书不仅仅能获得成长与启发，孩子可以根据每个主题，读懂名人故事，记忆精彩语句，运用到自己的作文中去，从而提高自己的写作能力。',
        //本书目录
        catalogues: ['像猴儿一样聪明伶俐', '明星传奇——齐天大圣孙悟空/8', '徐文长智取礼物/10', '智斗强盗/12', '正好与你相反/14', '100枚金币/16', '古董商买柜子/18', '与灵猴下棋/20', '穷才子和傻王子/22']
      },
      //同类书籍
      similarBook: [{
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-09",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg"
      },
      {
        bookName: "三生三世十里桃花",
        author: "唐七",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472252",
        imgUrl: "./img/1000008.jpg"
      },
      {
        bookName: "阿弥陀佛么么哒",
        author: "大冰",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-08",
        ISBN: "9787540472238",
        imgUrl: "./img/1000002.jpg"
      },
      {
        bookName: "论语解读/周读书系",
        author: "(春秋)孔子 撰;黄朴民 译注",
        press: "中南出版传媒集团股份有限公司",
        year: "2016-02",
        ISBN: "9787553804910",
        imgUrl: "./img/1000022.jpg"
      },
      {
        bookName: "离开前请叫醒我",
        author: "卢思浩",
        press: "中南出版传媒集团股份有限公司",
        year: "2015-06",
        ISBN: "9787540472139",
        imgUrl: "./img/1000010.jpg"
      },
      ],
      //购买推荐
      PurchaseRe: [{
        libraryName: "新华书店芙蓉中路店",
        address: "湖南省长沙市芙蓉区芙蓉中路二段76号湖南图书城1-4层"
      },
      {
        libraryName: "新华书店河西大学店",
        address: "长沙市麓山路303号"
      },
      {
        libraryName: "北京图书大厦店",
        address: "北京市西城区西长安街17号北京图书大厦"
      },
      {
        libraryName: "新华书店顺城店",
        address: "四川省成都市双流区顺城街3号"
      },
      {
        libraryName: "新华书店老福山购书中心",
        address: " 江西省南昌市西湖区八一大道102号新华大厦"
      },
      {
        libraryName: "新华书店内蒙古店",
        address: "内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
      }
      ],
      //借阅推荐
      borrowRe: [{
        libraryName: "内蒙古图书馆",
        address: "内蒙古呼和浩特市赛罕区乌兰察布西街34号"
      },
      {
        libraryName: "江西省图书馆",
        address: "江西省南昌市洪都北大道160号"
      }
      ],
      comment: [{
        userName: "无昵称用户",
        time: "2017-12-11 1:08:45",
        good: 3,
        bad: 3,
        con: "对孩子有帮助，作为课外的补充。"
      },
      {
        userName: "无昵称用户",
        time: "2017-11-14 14:27:05",
        good: 94,
        bad: 17,
        con: "拼音彩绘书，有多小故事确实可做作文素材，个人感觉比较好，孩子现在还是喜欢看绘本"
      },
      {
        userName: "无昵称用户",
        time: "2017-08-24 22:04:08",
        good: 117,
        bad: 49,
        con: "书很满意，装帧典雅、大方，包装精美，是一本值得收藏的好书正版，印刷业很清晰，内容更不用说。是一本性价比很高的书。"
      },
      {
        userName: "匿名用户",
        time: "2017-11-14 17:24:17",
        good: 8,
        bad: 1,
        con: "书看着厚实，里面的故事都带着拼音，值得入手，每天给孩子读读故事，孩子学了拼音，就可以自己读，能看很长一段时间"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-30 15:17:50",
        good: 6,
        bad: 1,
        con: "买回来讲了一遍宝宝就记住了一些情节，看到乌云就说风是最厉害的，因为会把云吹走。。。好欣慰，后来拿到幼儿园，其他小朋友也喜欢。"
      },
      {
        userName: "无昵称用户",
        time: "2017-10-19 13:07:17",
        good: 0,
        bad: 3,
        con: "一个代代相传的民间故事生动的传说故事，动听的民间童谣，久远的娶亲习俗和精致细腻的画面构成了本书强烈的民间和中国特色。在阅读中了解传统与文化体会寓意与幽默欣赏画面与细节。"
      }
      ]
    },
    //15.魅力江西

    {
      //书的信息
      BookInformation: {
        bookName: "魅力江西",
        author: "虞国庆",
        press: "中文天地出版股份有限公司",
        year: "2014-08",
        price: "32.00",
        Binding: "平装",
        folio: "16",
        ISBN: "9787210065838",
        imgUrl: "./img/1000032.jpg",
        authorIntro: "亲赴江西多次，记录真实的魅力江西。",
        //图书标签
        bookLabel: ['图书','历史','地方史志'],
        //主题词
        themaWords: ['江西省情概览'],
        //内容提要
        contentSummary: '《魅力江西 江西省情概览》分绿色家园、悠久历史、璀璨文化、红色摇篮、走向辉煌、追梦圆梦等六个篇章。纵贯往昔，横陈现状，全面展示了江西的悠久历史、灿烂文化、优美生态以及发展的巨大潜力和美好前景，旨在让广大青少年通过阅读《魅力江西 江西省情概览》，增强对家乡的认知度、自豪感、荣誉感和责任感，增添热爱家乡、建设家乡的热情。',
        //本书目录
        catalogues: ['第一章 绿色家园','第二章 悠久历史','第三章 璀璨文化','第四章 红色摇篮','第五章 走向辉煌','第六章 实现跨越','后记'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "闽***x",
          time: "2018-03-15 14:36",
          good: 4,
          bad: 0,
          con: "物流挺快的，书籍还是挺不错的，一览江西风土人情，物超所值!"
        },
        {
          userName: "春***成",
        time: "2017-12-31 15:12",
        good: 0,
        bad: 0,
        con: "给喜欢的人买的，喜欢的人不喜欢我，也不喜欢送她的礼物……好难过"
        },
        {
          userName: "S***I",
        time: "2017-09-13 13:05",
        good: 0,
        bad: 0,
        con: "质量，纸张的质素就不怎么的了。"
        }      
      ]
    },

//16.2015年修订版马克思主义基本原理概论

    {
      //书的信息
      BookInformation: {
        bookName: "2015年修订版马克思主义基本原理概论",
        author: "《马克思主义基本原理概论》编写组",
        press: "高等教育出版社有限公司",
        year: "2015-08",
        price: "23.00",
        Binding: "平装",
        folio: "16开",
        ISBN: "9787040431971",
        imgUrl: "./img/1000030.jpg",
        authorIntro: "整理汇编旧版概论，重新编排。",
        //图书标签
        bookLabel: ['公共课','军事','政治','马克思主义理论'],
        //主题词
        themaWords: ['马克思主义理论'],
        //内容提要
        contentSummary: '"《马克思主义基本原理概论》（2015年修订版）是中宣部、教育部组织专家学者修订编写的“马克思主义理论研究和建设工程重点教材”。本书充分反映了去年以来我们党在理论和实践上的创新成果，特别是党的十七届四中全会精神和2009年中央经济工作会议精神，反映了新中国成立60年来经济建设、政治建设、文化建设、社会建设和党的建设取得的巨大成就和宝贵经验，反映了我国以民族平等，民族团结、民族区域自治和各民族共同繁荣为基本内容的民族政策和民族政策体系。为全国普通高等学校思想政治理论课统一使用教材。',
        //本书目录
        catalogues: ['第一章  世界的物质性及其发展规律','第二章  认识的本质及其发展规律','第三章  人类社会及其发展规律','第四章  资本主义的形成及其本质','第五章  资本主义发展的历史进程','第六章  社会主义社会及其发展','第七章  共产主义崇高理想及其最终实现','后记'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "匿名用户",
          time: "2017-04-27 10:41:12",
          good: 0,
          bad: 0,
          con: "这本高教版的马克思主义基本原理概论，很权威的一本教材，值得一看。"
        },
        {
          userName: "清***0(匿名)",
          time: "2017-06-15 10:48:20",
          good: 0,
          bad: 0,
          con: "高校出版社的书，整个来说质量还是非常好的，也值得一读。"
        },
        {
          userName: "匿名用户",
          time: "2016-08-21 13:25:03",
          good: 0,
          bad: 0,
          con: "新版的，和13版在内容结构上有一些变化，不过内容变化几乎不变"
        },
        {
          userName: "无昵称用户",
          time: "2015-10-23 11:35:23",
          good: 0,
          bad: 0,
          con: "没想到一天就收到了！对于考研的我来说特别的及时！买过很多书 这个真的一看就是正版 纸质厚白清晰 书皮也硬真的很棒！以后买就在当当啦 真的是明智的选择 买教材正版。"
        },
        {
          userName: "anaelisa",
          time: "2016-06-26 14:59:13",
          good: 0,
          bad: 0,
          con: "虽然没有包装，但是是新书，没有折痕，没有缺页漏页，应该是正品。"
        },
        {
          userName: "野外老剑仙",
          time: "2016-05-19 09:26:34",
          good: 0,
          bad: 0,
          con: "书很好应该正版，可是感觉这个版本不如2010的好看美观了"
        }
      ]
    },
//17.商务英语视听说(高等学校英语拓展系列教程)

    {
      //书的信息
      BookInformation: {
        bookName: "商务英语视听说(高等学校英语拓展系列教程)",
        author: "李毅",
        press: "外语教学与研究出版社",
        year: "2013-05",
        price: "35.90",
        Binding: "平装",
        folio: "16开",
        ISBN: "9787560086644",
        imgUrl: "./img/1000038.jpg",
        authorIntro: "教授，硕士生导师。大连医科大学艺术学院院长。从事视觉艺术理论研究和摄影教育教学工作20余年，是国内摄影专业教育领域内影响较大的学科带头人、辽宁省特色专业负责人。",
        //图书标签
        bookLabel: ['职场英语','商务','生活实用英语','口语','外语'],
        //主题词
        themaWords: ['商务英语'],
        //内容提要
        contentSummary: '《商务英语视听说》涵盖商务英语交际的不同方面，从语言知识、交际技巧、商务实践三个层面，帮助学生掌握语言技能，了解商务知识，操练商务交际能力。《商务英语视听说》适合修完大学英语基础课程或完成一年级教学任务的大学本科学生，可作为后续ESP课程、选修课程或大学专业英语的导入课程开设。每单元包括：主题导入；听说练习；语言要点；视说练习；案例分析或调查报告。',
        //本书目录
        catalogues: ['Unit  1   Job Interviews','Unit 2   Jobs and Responsibilities','Unit  3   On the Phone','Unit  4   At a Meeting','Unit  5   Travel and Visits','Unit  6   Company Presentations','Unit 7   Product Presentations','Unit  8   Company Performance','Unit  9   Trade Fairs','Unit 10   Making Inquiries','Unit 11    Placing an Order','Unit 12   Terms of Payment','Unit 13   Delivery','Unit 14   Claims and Settlements','Unit 15   Marketing','Unit 16   Advertising','Glossary'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "无昵称用户",
          time: "2016-02-19 13:32:20",
          good: 0,
          bad: 0,
          con: "编排非常好，老师上课选用材料很实用，既有词汇、情景句型，又有不同场景的视听材料，发音很正宗！"
        },
        {
          userName: "书之鲜",
          time: "2016-09-09 09:08:12",
          good: 0,
          bad: 0,
          con: "这次是帮同学买的。学校好像特别好感这套教材？"
        },
        {
          userName: "安之daybre...",
          time: "2014-05-25 22:20:54",
          good: 0,
          bad: 0,
          con: "买来后一翻开就知道买亏了。这本书名为本科生编写，其实和编者编写的高职高专教材大同小异。那套书我几年前就买来当参考书了。"
        },
        {
          userName: "购我所艾",
          time: "2014-12-17 07:48:05",
          good: 0,
          bad: 0,
          con: "内容实用 光碟靠谱 是学习商英的好书籍 值得推荐"
        },
        {
          userName: "yjmhslcg",
          time: "2013-09-06 13:42:49",
          good: 0,
          bad: 0,
          con: "有视频，如临其境，有听说，形式多样，这本书不错！配套教师用书怎么没有？"
        },
        {
          userName: "不忘本心",
          time: "2013-09-27 20:04:38",
          good: 0,
          bad: 0,
          con: "咱班里团购的，还算不错吧，老师让我们定的，内容挺实用的，光碟用起来感觉都是正版的，总体就好好的"
        }
      ]
    },

//18.读论语 学成语

    {
      //书的信息
      BookInformation: {
        bookName: "读论语 学成语",
        author: "韩兴娥,徐美华",
        press: "中文天地出版股份有限公司",
        year: "2015-06",
        price: "25.00",
        Binding: "平装",
        folio: "16开",
        ISBN: "9787210074199",
        imgUrl: "./img/1000043.jpg",
        authorIntro: "韩兴娥，山东省潍坊市北海学校语文高级教师。齐鲁名师。她用两个星期就带领三年级学生学完语文课本并取得较好的考试成绩，剩下的时间师生在课堂上共读课外书，被评为“全国2010年推动读书十大人物”。",
        //图书标签
        bookLabel: ['语文','小学一年级','中小学教辅'],
        //主题词
        themaWords: ['教辅'],
        //内容提要
        contentSummary: '如果说有一本内容精彩的书能打开你的省身之门，那么，非《读论语学成语》一书莫属。它没有华丽的辞藻，只有朴实的道理，却耐人寻味，字里行问充溢着至真至善。《读论语学成语》学成语有趣多了。一个个论语小故事，不仅能够轻松记住了成语，让读者明白了许多做人的道理。',
        //本书目录
        catalogues: ['一 学而篇1','二 为政篇21','三 八佾篇4','四 里仁篇55','五 公冶长篇75','...'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "l***a",
          time: "2016-09-08 13:53",
          good: 0,
          bad: 0,
          con: "刚到，很好"
        }
      ]
    },

//19.笨狼的故事

    {
      //书的信息
      BookInformation: {
        bookName: "笨狼的故事",
        author: "汤素兰",
        press: "中南传媒",
        year: "2015-09",
        price: "26.00",
        Binding: "平装",
        folio: "32开",
        ISBN: "9787556204731",
        imgUrl: "./img/1000048.jpg",
        authorIntro: "汤素兰，女，汉族，1965年1月出生，湖南宁乡人，硕士研究生，文学硕士，1985年7月参加工作，2001年12月加入中国民主促进会。中国一级作家，教授，编审，中国作家协会会员，中国作家协会第九届全国委员会委员。",
        //图书标签
        bookLabel: ['图书','童书','中国儿童文学','童话故事','图书','童书','7-10岁','童话'],
        //主题词
        themaWords: ['中国版的小熊温尼'],
        //内容提要
        contentSummary: '一个大大的电视机，让小动物们都能当演员在里面表演节目；居然他还把自己的家都给给弄丢了。笨狼看上去笨笨的，却总是有许多新奇的想法，是个惹人怜爱的、非常善良的小家伙。',
        //本书目录
        catalogues: ['1. 笨狼是谁','2. 把家弄丢了','3. 晾尾巴','4. 半小时爸爸','5. 倒霉的一天','6. 当售票员','7. 上学'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "无昵称用户",
          time: "2017-12-09 09:50:56",
          good: 0,
          bad: 0,
          con: "笨狼是孩子指名要买的系列，每晚看得不愿意睡觉，看到好笑的片段还要跑过来跟我说，每天都恳求我同意他带到学校，怕影响学习，同意每周四能带去，开心到不得了，好"
        },
        {
          userName: "匿名用户",
          time: "2017-06-14 09:25:36",
          good: 0,
          bad: 0,
          con: "学校推荐看的书，反正孩子也喜欢看，一直偏向国外文学，国内的都是学校推荐居多。在孩子的世界里什么都可以是可爱，包括狼。这大概就是孩子善良的世界"
        },
        {
          userName: "语***8",
          time: "2017-04-12 08:46:29",
          good: 0,
          bad: 0,
          con: "故事情节是符合一二年级小学生的理解水平，孩子看得很开心"
        },
        {
          userName: "z***3",
          time: "2017-07-29 11:29:52",
          good: 0,
          bad: 0,
          con: "很好，孩子非常喜欢看！"
        },
        {
          userName: "无昵称用户",
          time: "2018-02-08 22:51:27",
          good: 0,
          bad: 0,
          con: "帮别人买的，听说很不错啊。 "
        },
        {
          userName: "王明鹤",
          time: "2017-10-29 22:08:28",
          good: 0,
          bad: 0,
          con: "送货快，孩子喜欢，必读！"
        }
      ]
    },

//20. Word/Excel/PowerPoint2010三合一办公应用

    {
      //书的信息
      BookInformation: {
        bookName: "Word/Excel/PowerPoint2010三合一办公应用",
        author: "神龙工作室 等",
        press: "人民邮电出版社",
        year: "2014-04",
        price: "49.80",
        Binding: "平装",
        folio: "16开",
        ISBN: "9787115344298",
        imgUrl: "./img/1000050.jpg",
        authorIntro: "收集整理多种办公软件教程，整理成可用图书.",
        //图书标签
        bookLabel: ['微软Office','家庭与办公室用书','计算机/网络'],
        //主题词
        themaWords: ['历经时间检验的经典童话作品'],
        //内容提要
        contentSummary: '《Word/Excel/PowerPoint 2010三合一办公应用》附带一张专业级的DVD格式的多媒体教学光盘，提供长达10个小时的与本书内容同步的多媒体教学内容。通过全程视频讲解，对书中知识点进行深入讲解，一步一步地引导读者掌握使用Word、Excel和PowerPoint进行日常办公的各种操作与应用。此外光盘中还附有书中所有实例对应的原始文件、素材文件以及*终效果文件.',
        //本书目录
        catalogues: ['第1篇　Word办公应用','第2章　图形、图表与简单排版','第3篇　PowerPoint办公应用','第4章　数据透视表与数据透视图','第5章　排序、筛选与分类汇总','第6章　美化与打印工作表','第7章　保护与共享工作簿'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "无昵称用户",
          time: "2017-12-09 09:50:56",
          good: 0,
          bad: 0,
          con: "笨狼是孩子指名要买的系列，每晚看得不愿意睡觉，看到好笑的片段还要跑过来跟我说，每天都恳求我同意他带到学校，怕影响学习，同意每周四能带去，开心到不得了，好"
        },
        {
          userName: "匿名用户",
          time: "2017-06-14 09:25:36",
          good: 0,
          bad: 0,
          con: "学校推荐看的书，反正孩子也喜欢看，一直偏向国外文学，国内的都是学校推荐居多。在孩子的世界里什么都可以是可爱，包括狼。这大概就是孩子善良的世界。"
        },
        {
          userName: "语***8",
          time: "2017-04-12 08:46:29",
          good: 0,
          bad: 0,
          con: "故事情节是符合一二年级小学生的理解水平，孩子看得很开心"
        },
        {
          userName: "无昵称用户",
          time: "2015-09-02 12:58:39",
          good: 0,
          bad: 0,
          con: "送货快，孩子喜欢，必读！"
        },
        {
          userName: "王明鹤",
          time: "2017-10-29 22:08:28",
          good: 0,
          bad: 0,
          con: " 哈哈，这套儿子特别喜欢，相当经典！"
        },
        {
          userName: "无昵称用户",
          time: "2017-09-05 15:47:35",
          good: 0,
          bad: 0,
          con: "产品质量较好、送货速度快、服务态度较好，总体评价为优"
        }
      ]
    },
//21.英语1(基础模块)

    {
      //书的信息
      BookInformation: {
        bookName: "英语1(基础模块)",
        author: "中等职业学校英语教材编写组",
        press: "高等教育出版社有限公司",
        year: "2011-05",
        price: "18.60",
        Binding: "平装",
        folio: "16开",
        ISBN: "9787040269871",
        imgUrl: "./img/1000057.jpg",
        authorIntro: "中等职业学校英语教材编写组,汇集多位资深职教经验丰富的在职教师团队。",
        //图书标签
        bookLabel: ['中职教育','征订教材','教材'],
        //主题词
        themaWords: ['英语基础'],
        //内容提要
        contentSummary: '《英语1（基础模块）》安排了不同形式的任务，例如制作海报、计划生日聚会、找工作伙伴、组建兴趣小组，等等。在完成任务的过程中，你们会发现学习英语不再是枯燥地记忆单词和语法，而是在仿真的生活或工作场景中运用英语去听、去说、去做。相信同学们通过认真学习，一定能用所学英语制作出自己的名片或班级活动海报等，并体验到英语学习的成就感。',
        //本书目录
        catalogues: ['Unit  1   Interviews','Unit 2   Responsibilities','Unit  3   The Phone','Unit  4   Meeting','Unit  5   Travel and Visits'],
      },
      //同类书籍
      similarBook: [
        {
          bookName: "摆渡人(精装插图纪念版)(精)",
          author: "[英]克莱儿·麦克福尔",
          press: "中文天地出版股份有限公司",
          year: "2016-09",
          ISBN: "9787550016903",
          imgUrl: "./img/1000004.jpg",
        },
        {
          bookName: "乒乒和乓乓钓大鱼(精)",
          author: "宫西达也 文/图，熊春，蒲蒲兰　译",
          press: "中文天地出版股份有限公司",
          year: "2007-10",
          ISBN: "9787539139340",
          imgUrl: "./img/1000012.jpg"
        },
        {
          bookName: "妈妈和女儿的悄悄话",
          author: "金毓菡",
          press: "中文天地出版股份有限公司",
          year: "2010-07",
          ISBN: "9787539037080",
          imgUrl: "./img/1000054.jpg"
        },
        {
          bookName: "三生三世十里桃花",
          author: "唐七",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-06",
          ISBN: "9787540472252",
          imgUrl: "./img/1000008.jpg"
        },
        {
          bookName: "阿弥陀佛么么哒",
          author: "大冰",
          press: "中南出版传媒集团股份有限公司",
          year: "2015-08",
          ISBN: "9787540472238",
          imgUrl: "./img/1000002.jpg"
        },
  
      ],
      //购买推荐
      PurchaseRe: [{
          libraryName: "上海书城福州店",
          address: "上海市黄浦区福州路465号世纪出版大厦"
        },
        {
          libraryName: "崇文书城",
          address: "武汉市洪山区雄楚大道268号"
        },
        {
          libraryName: "新华书店长沙市分公司",
          address: "长沙市五一东路285号"
        },
        {
          libraryName: "新华书店武侯祠店",
          address: "成都市武侯区武侯祠大街266号华达商城1层"
        },
        {
          libraryName: "新华书店内蒙古店",
          address: " 内蒙古自治区呼和浩特市回民区中山西路49号(天元大酒店)"
        },
        {
          libraryName: "云南新华大厦",
          address: "昆明市人民东路6号"
        }
      ],
      //借阅推荐
      borrowRe: [{
          libraryName: "湖南图书馆",
          address: "湖南省长沙市芙蓉区韶山北路157号"
        },
        {
          libraryName: "江西省图书馆",
          address: "江西省南昌市洪都北大道160号"
        }
      ],
      comment: [{
          userName: "匿名用户",
          time: "2017-08-03 17:23:43",
          good: 0,
          bad: 0,
          con: "语音清晰，和配套的教材使用很不错，主要是让孩子适应一下语音环境。"
        },
        {
          userName: "匿名用户",
          time: "2018-02-11 20:24:31",
          good: 0,
          bad: 0,
          con: "正版书籍，值得推荐，到货快，非常满意！"
        },
        {
          userName: "无昵称用户",
          time: "2018-02-11 10:41:55",
          good: 0,
          bad: 0,
          con: "此套书真是价格便宜又实用，很适合学英文，前言还教授了如何学英语。就是不知道mp3音频在哪儿可以找到"
        },
        {
          userName: "无昵称用户",
          time: "2017-12-24 11:53:26",
          good: 0,
          bad: 0,
          con: "这么多也没箱子，快递员是白字先生，这十本书是一个非常薄的塑封，从袋子里拿出来就烂了！好在书没什么事儿，就一张简易CD，比没CD贵那么多！"
        }
      ]
    }
  ]
  //同类书籍
  var renderSimilarBook = function(index) {
    var smailarLen = data[index].similarBook.length;
    var html = "";
    var imgUrl;

    for (let i = 0; i < smailarLen; i++) {
      imgUrl = data[index].similarBook[i].imgUrl;
      imgUrl = imgUrl === './fourImg/20000.jpg' ? './fourImg/404.svg' : imgUrl;

      html +=
        "<li>" +
        '<img class="fl" src="' +
        imgUrl +
        '" alt="">' +
        '<dl class="fl">' +
        "<dt>" +
        data[index].similarBook[i].bookName +
        "</dt>" +
        "<dd>" +
        "<p>作者: " +
        data[index].similarBook[i].author +
        "</p>" +
        "<p>出版社: " +
        data[index].similarBook[i].press +
        "</p>" +
        "<p>出版年: " +
        data[index].similarBook[i].year +
        "</p>" +
        "<p>ISBN: " +
        data[index].similarBook[i].ISBN +
        "</p>" +
        "</dd>" +
        "</dl>" +
        "</li>";
    }
    $(".aside-left ul").html(html);
  };

  // 书的信息
  var renderBookInfo = function(index) {
    var html =
      '<img class="fl" src="' +
      data[index].BookInformation.imgUrl +
      '" alt="">' +
      '<dl class="fl">' +
      "<dt>" +
      data[index].BookInformation.bookName +
      "</dt>" +
      "<dd>" +
      "<p>作者: " +
      data[index].BookInformation.author +
      "</p>" +
      "<p>出版社: " +
      data[index].BookInformation.press +
      "</p>" +
      "<p>出版年: " +
      data[index].BookInformation.year +
      "</p>" +
      "<p>定价: " +
      data[index].BookInformation.price +
      "元</p>" +
      "<p>装帧: " +
      data[index].BookInformation.Binding +
      "</p>" +
      "<p>开本: " +
      data[index].BookInformation.folio +
      "开</p>" +
      "<p>ISBN: " +
      data[index].BookInformation.ISBN +
      "</p>" +
      "</dd>" +
      "</dl>";

    $(".middle_con .middle_top .con_left").html(html);
  };

  //图书标签
  var renderBookLabel = function(index) {
    var html = "";

    var bookLabelLen = data[index].BookInformation.bookLabel.length;

    for (let i = 0; i < bookLabelLen; i++) {
      html += " <li>" + data[index].BookInformation.bookLabel[i] + "</li>";
    }

    $(".middle_con .middle_top .con_right .bookLabel").html(html);
  };

  //主题推荐
  var renderBookSubject = function(index) {
    var themLen = data[index].BookInformation.themaWords.length;
    var html = "";

    for (let i = 0; i < themLen; i++) {
      html += "<li>" + data[index].BookInformation.themaWords[i] + "</li>";
    }

    $(".middle_con .middle_top .con_right .themaWords").html(html);
  };

  // 内容提要
  var renderContentSummary = function(index) {
    $(".middle_con .middle_top .con_link .link_con").text(
      data[index].BookInformation.contentSummary
    );
  };

  //本书目录、作者
  var renderBookCatalog = function(index) {
    var len, html;
    len = data[index].BookInformation.catalogues.length;
    html = "";

    for (let i = 0; i < len; i++) {
      html += " <li>" + data[index].BookInformation.catalogues[i] + "</li>";
    }
    $(".middle_con .middle_top .con_link .link_ul").html(html);
    /* 本书作者 */
    $(".middle_con .middle_top .con_link .link_author").html(
      data[index].BookInformation.authorIntro
    );
  };

  // 购买推荐
  var renderRecommend = function(index) {
    var len, html;
    len = data[index].PurchaseRe.length;
    html = "";

    for (let i = 0; i < len; i++) {
      html +=
        '<dl class="clearfix">' +
        "<dt >" +
        '<span class="number">' +
        (i + 1) +
        ":" +
        "</span>" +
        '<span class="title">' +
        data[index].PurchaseRe[i].libraryName +
        "</span>" +
        "</dt>" +
        "<dd>地址: " +
        data[index].PurchaseRe[i].address +
        "</dd>" +
        "</dl>";
    }
    $(".middle_button .button_left .button_con .purchase").html(html);
  };

  //借阅推荐
  var renderBorrowRecommend = function(index) {
    var len, html;
    len = data[index].borrowRe.length;
    html = "";

    for (let i = 0; i < len; i++) {
      html +=
        '<dl class="clearfix">' +
        "<dt >" +
        '<span class="number">' +
        (i + 1) +
        ":" +
        "</span>" +
        '<span class="title">' +
        data[index].borrowRe[i].libraryName +
        "</span>" +
        "</dt>" +
        "<dd>地址: " +
        data[index].borrowRe[i].address +
        "</dd>" +
        "</dl>";
    }
    $(".middle_button .button_right .button_con .jieyue").html(html);
  };

  // 图书评论
  var renderBookComment = function(index) {
    var len, html;
    len = data[index].comment.length;
    html = "";

    for (let i = 0; i < len; i++) {
      html +=
        '<dl class="clearfix">' +
        '<dt class="clearfix">' +
        '<div class="fl user">' +
        "<p>" +
        data[index].comment[i].userName +
        "</p>" +
        '<p class="time">' +
        data[index].comment[i].time +
        "</p>" +
        "</div>" +
        '<div class="fr comment">' +
        '<span class="comment_one iconfont icon-pinglun">' +
        data[index].comment[i].bad +
        "</span>" +
        '<span class="iconfont icon-xin">' +
        data[index].comment[i].good +
        "</span>" +
        "</div>" +
        "</dt>" +
        '<dd class="clearfix">' +
        data[index].comment[i].con +
        "</dd>" +
        "</dl>";
    }
    $(".aside-right .aside_con").html(html);
  };

  /* 渲染页面 */
  var renderBookDetail = function(index) {
    renderSimilarBook(index);
    renderBookInfo(index);
    renderBookLabel(index);
    renderBookSubject(index);
    renderContentSummary(index);
    renderBookCatalog(index);
    renderRecommend(index);
    renderBorrowRecommend(index);
    renderBookComment(index);
  };
  renderBookDetail(index);

  var showSimilarBookInfo = function() {
    var similarBook = $(".aside-left>ul");

    similarBook.on("click", 'li', function(el) {
      var curItem = $(el.currentTarget);
      var bookName = curItem.find('dt').text().trim();
      var hasBook = false;
      var index = 0;

      for(var i = 0; i < data.length; i++) {
        if (data[i]["BookInformation"]["bookName"] === bookName) {
          index = i;
          hasBook = true;
          break;
        }
      }

      if (hasBook) renderBookDetail(index);

    });
  };

  showSimilarBookInfo();

  // 畅销书排行榜获取高度
  var rankH = $(".con li:nth-child(2) .book-rank").height();
  var rankShowH = 3.5 * rankH;
  var overHiddenH = rankH * 5 + rankShowH;
  $(".book-show").css("height", rankShowH + "px");
  var curBookRank = $(".aside-left li.active .book-rank");
  curBookRank.css("height", rankH + "px");

  //   获取行高
  var topSpan = $(".aside-left .top .book-rank span");
  var topSpanH = topSpan.height();
  topSpan.css("line-height", topSpanH + "px");

  var bottomSpan = $(".aside-left .bottom .book-rank span");
  var bottomSpanH = bottomSpan.height();
  bottomSpan.css("line-height", bottomSpanH + "px");

  //   获取各地区销售码洋排行高度
  var areaRankBox = $(".aside-right .area-rank .con");
  var areaRankH = areaRankBox.height();
  var areaRankLiH = Math.round(areaRankH / 3);
  areaRankBox.find("li").css("height", areaRankLiH + "px");
  var areaUl = areaRankBox.children("ul");

  var areaUlH = areaUl.height();
  // 定时动画效果
  // 销售码洋排行
  var num = 0;
  setInterval(function() {
    num++;
    num > 4 ? (num = 0) : num;
    areaUl.css("top", -(num * areaRankH) + "px");
  }, 2000);
  //   同类图书
  function fanzhuan(parent, children, num, time, state) {
    clearInterval(parent.timer);

    var pressNum = -1;

    var rankbUl = $(parent);
    var rankbLen = rankbUl.children().length;
    parent.timer = setInterval(function() {
      pressNum++;

      if (pressNum >= num) {
        if (!state) {
          $(children).hide();
        }
      }
      if (pressNum > rankbLen) {
        pressNum = -1;
        if (!state) {
          $(children).show();
        }
      }
      // console.log(pressNum)
      var curLi = rankbUl.children().eq(pressNum);
      // console.log(curLi);
      if (state) {
        curLi.addClass("pressRotate");
        curLi.siblings().removeClass("pressRotate");
      }
    }, time);
  }
  fanzhuan(".aside-left  ul", ".aside-left  li:lt(5)", 5, 1500, true);
  fanzhuan(
    ".aside-right .con_top .aside_con",
    ".aside-right .con_top .aside_con dl:lt(3)",
    2,
    1000
  );
  // fanzhuan('.aside-right .con_button .aside_con', '.aside-right .con_button .aside_con dl:lt(3)', 2,800)

  // 推荐
  function translate($dom, $childrenFirst) {
    var $uList = $($dom);
    var timer = null;
    //触摸清空定时器
    $uList
      .hover(
        function() {
          clearInterval(timer);
        },
        function() {
          //离开启动定时器
          timer = setInterval(function() {
            scrollList($uList);
          }, 1000);
        }
      )
      .trigger("mouseleave"); //自动触发触摸事件

    //滚动动画
    function scrollList(obj) {
      //获得当前<li>的高度
      var scrollHeight = $($childrenFirst).height();
      //滚动出一个<li>的高度
      $uList.stop().animate(
        {
          marginTop: -scrollHeight
        },
        600,
        function() {
          //动画结束后，将当前<ul>marginTop置为初始值0状态，再将第一个<li>拼接到末尾。
          $uList
            .css({
              marginTop: 0
            })
            .find("dl:first")
            .appendTo($uList);
        }
      );
    }
  }

  translate(
    ".button_left .button_con .container",
    ".button_left .button_con .container dl:first"
  );
  translate(
    ".button_right .button_con .container",
    ".button_right .button_con .container dl:first"
  );
  //   畅销书排行
  var ranktUl = $(".aside-left .top ul");
  var bookLiLen = ranktUl.children().length;

  var bookNum = 0;

  var timer01 = setInterval(function() {
    bookNum++;
    // debugger
    if (bookNum % 5 == 0) {
      $(".aside-left .top li:lt(" + bookNum + ")").hide();
    }

    if (bookNum == bookLiLen) {
      bookNum = 0;
      ranktUl.children().show();
    }

    ranktUl.children().removeClass("active");
    ranktUl
      .children()
      .eq(bookNum)
      .addClass("active");

    ranktUl.find(".book-show").hide();
    ranktUl
      .children()
      .eq(bookNum)
      .children(".book-show")
      .show();
  }, 2000);
});

// // //   // 饼图
// // var pie1 = echarts.init(document.getElementById("pie1"), "macarons");
// // var pie2 = echarts.init(document.getElementById("pie2"), "macarons");

// // var rich = {
// //   big: {
// //     fontSize: 24,
// //     lineHeight: 40,
// //     fontFamily: "Rubik"
// //   },
// //   small: {
// //     fontSize: 16
// //   }
// // };
// var pieOption1 = {
//   series: [
//     {
//       name: "销售占比",
//       type: "pie",
//       radius: ["50%", "70%"],
//       hoverOffset: 5,
//       center: ["50%", "40%"],
//       avoidLabelOverlap: false,
//       color: ["#0239a7", "#fff", "#24feb4", "#23539b", "#3c9de4"],
//       label: {
//         normal: {
//           show: false,
//           position: "center"
//         },
//         emphasis: {
//           show: true,
//           color: "#fff",
//           formatter: function(params, ticket, callback) {
//             return (
//               "{big|" + params.value + "}{small|%}\n{small|" + params.name + "}"
//             );
//           },
//           // '{a|这段文本采用样式a}'
//           rich: rich
//         }
//       },
//       labelLine: {
//         normal: {
//           show: false
//         }
//       },
//       data: [
//         {
//           value: 18.6,
//           name: "社科",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 13.8,
//           name: "教育",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 9.1,
//           name: "文艺",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 6.4,
//           name: "少儿",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 52.1,
//           name: "其他",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         }
//       ]
//     }
//   ]
// };
// var pieOption2 = {
//   series: [
//     {
//       name: "库存占比",
//       type: "pie",
//       radius: ["50%", "70%"],
//       hoverOffset: 10,
//       avoidLabelOverlap: false,
//       color: ["#23539b", "#24feb4", "#fff", "#0239a7", "#3c9de4"],
//       center: ["50%", "40%"],
//       label: {
//         normal: {
//           show: false,
//           position: "center"
//         },
//         emphasis: {
//           show: true,
//           color: "#fff",
//           formatter: function(params, ticket, callback) {
//             return (
//               "{big|" + params.value + "}{small|%}\n{small|" + params.name + "}"
//             );
//           },
//           // '{a|这段文本采用样式a}'
//           rich: rich
//         }
//       },
//       labelLine: {
//         normal: {
//           show: false
//         }
//       },
//       data: [
//         {
//           value: 20.5,
//           name: "少儿",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 15.7,
//           name: "文艺",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 9.6,
//           name: "教育",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 7.3,
//           name: "社科",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         },
//         {
//           value: 46.9,
//           name: "其他",
//           label: {
//             normal: {
//               formatter: "{c}%\n\n{b}"
//             }
//           }
//         }
//       ]
//     }
//   ]
// };
// pie1.currentIndex = -1;
// pie1.setOption(pieOption1);

// setInterval(function() {
//   var dataLen = pieOption1.series[0].data.length;
//   // 取消之前高亮的图形
//   pie1.dispatchAction({
//     type: "downplay",
//     seriesIndex: 0,
//     dataIndex: pie1.currentIndex
//   });
//   pie1.currentIndex = (pie1.currentIndex + 1) % dataLen;
//   // 高亮当前图形
//   pie1.dispatchAction({
//     type: "highlight",
//     seriesIndex: 0,
//     dataIndex: pie1.currentIndex
//   });
// }, 1000);

// pie2.currentIndex = -1;

// pie2.setOption(pieOption2);
// setInterval(function() {
//   var dataLen = pieOption2.series[0].data.length;
//   // 取消之前高亮的图形
//   pie2.dispatchAction({
//     type: "downplay",
//     seriesIndex: 0,
//     dataIndex: pie2.currentIndex
//   });
//   pie2.currentIndex = (pie2.currentIndex + 1) % dataLen;
//   // 高亮当前图形
//   pie2.dispatchAction({
//     type: "highlight",
//     seriesIndex: 0,
//     dataIndex: pie2.currentIndex
//   });
// }, 1000);
// //   // 柱形折线图

// var trendBar1 = echarts.init(document.getElementById("trendBar1"));

// var optionBar = {
//   grid: {
//     top: 50,
//     bottom: "20%"
//   },
//   legend: {
//     data: ["销售码洋", "同比增长"],
//     right: "5%",
//     itemWidth: 18,
//     itemHeight: 12,
//     textStyle: {
//       color: "#fff"
//     }
//   },
//   xAxis: {
//     data: [
//       "1月",
//       "2月",
//       "3月",
//       "4月",
//       "5月",
//       "6月",
//       "7月",
//       "8月",
//       "9月",
//       "10月",
//       "11月",
//       "12月"
//     ],
//     axisLine: {
//       show: false,
//       lineStyle: {
//         color: "#07bffb"
//       }
//     },
//     axisTick: {
//       show: false
//     },
//     axisLabel: {
//       interval: 0
//     }
//   },
//   yAxis: [
//     {
//       name: "码洋(/千万)",
//       axisLine: {
//         show: false,
//         lineStyle: {
//           color: "#07bffb"
//         }
//       },
//       splitLine: {
//         show: false
//       },
//       axisTick: {
//         show: false
//       },
//       interval: 5,
//       min: 0,
//       max: 20,
//       position: "left"
//     },
//     {
//       name: "同比增长(%)",
//       max: 100,
//       min: 0,
//       axisLabel: {
//         formatter: "{value}"
//       },
//       axisLine: {
//         show: false,
//         lineStyle: {
//           color: "#07bffb"
//         }
//       },
//       splitLine: {
//         show: false
//       },
//       axisTick: {
//         show: false
//       },
//       position: "right"
//     }
//   ],
//   series: [
//     {
//       name: "销售码洋",
//       type: "bar",
//       barWidth: "40%",
//       barGap: 5,
//       itemStyle: {
//         normal: {
//           color: new echarts.graphic.LinearGradient(
//             0,
//             0,
//             0,
//             1,
//             [
//               {
//                 offset: 0,
//                 color: "#00fecc"
//               },
//               {
//                 offset: 0.8,
//                 color: "#2690cf"
//               }
//             ],
//             false
//           )
//         }
//       },
//       data: [2.5, 5.4, 6.4, 4.4, 5.7, 11, 12, 10, 8, 14, 18, 19]
//     },
//     {
//       name: "同比增长",
//       type: "line",
//       itemStyle: {
//         color: "#fff"
//       },
//       yAxisIndex: 1,
//       data: [10, 8, 36, 12, 24, 16, 48, 32, 18, 14, 66, 70]
//     }
//   ]
// };
// trendBar1.setOption(optionBar);
